Repository: p11-glue/p11-kit
Catalog: po/*.po
Languages: kk

source: usage: %s command <args>...
kk: қолданылуы: %s команда <аргументтер>...

source: Common %s commands are:
kk: Жалпы %s командалары:

source: See '%s <command> --help' for more information
kk: Көбірек ақпарат алу үшін '%s <команда> --help' қараңыз

source: no command specified
kk: команда көрсетілмеген

source: unknown global option: %s
kk: белгісіз глобалды опция: %s

source: unknown global option: -%c
kk: белгісіз глобалды опция: -%c

source: '%s' is not a valid command. See '%s --help'
kk: '%s' — жарамды команда емес. '%s --help' қараңыз

source: %s: unexpected pem block
kk: %s: күтпеген pem блогы

source: %s: unexpected section header
kk: %s: күтпеген бөлім тақырыптамасы

source: invalid mode for 'user-config': %s
kk: 'user-config' үшін жарамсыз режим: %s

source: invalid config filename, will be ignored in the future: %s
kk: баптау файлының аты жарамсыз, болашақта еленбейді: %s

source: couldn't list directory: %s
kk: бума тізімін шығару мүмкін емес: %s

source: couldn't stat path: %s
kk: жол күйін алу мүмкін емес: %s

source: invalid setting '%s' defaulting to '%s'
kk: '%s' параметрі жарамсыз, '%s' әдепкі мәні қолданылады

source: filter cannot be initialized
kk: сүзгіні инициализациялау мүмкін емес

source: couldn't load module info: %s
kk: модуль ақпаратын жүктеу мүмкін емес: %s

source: extra arguments specified
kk: артық аргументтер көрсетілген

source: The operation was cancelled
kk: Әрекеттен бас тартылды

source: Insufficient memory available
kk: Қолжетерлік жады жеткіліксіз

source: The specified slot ID is not valid
kk: Көрсетілген слот ID жарамсыз

source: Internal error
kk: Ішкі қате

source: The operation failed
kk: Әрекет сәтсіз аяқталды

source: Invalid arguments
kk: Жарамсыз аргументтер

source: The module cannot create needed threads
kk: Модуль қажетті ағындарды жасай алмайды

source: The module cannot lock data properly
kk: Модуль деректерді дұрыс құлыптай алмайды

source: The field is read-only
kk: Өріс тек оқуға арналған

source: The field is sensitive and cannot be revealed
kk: Өріс құпия және оны көрсетуге болмайды

source: The field is invalid or does not exist
kk: Өріс жарамсыз немесе жоқ

source: Invalid value for field
kk: Өріс үшін жарамсыз мән

source: The data is not valid or unrecognized
kk: Деректер жарамсыз немесе танылмады

source: The data is too long
kk: Деректер тым ұзын

source: An error occurred on the device
kk: Құрылғыда қате орын алды

source: Insufficient memory available on the device
kk: Құрылғыда қолжетімді жады жеткіліксіз

source: The device was removed or unplugged
kk: Құрылғы алынды немесе ажыратылды

source: The encrypted data is not valid or unrecognized
kk: Шифрланған деректер жарамсыз немесе танылмады

source: The encrypted data is too long
kk: Шифрланған деректер тым ұзын

source: This operation is not supported
kk: Бұл операцияға қолдау көрсетілмейді

source: The key is missing or invalid
kk: Кілт жоқ немесе жарамсыз

source: The key is the wrong size
kk: Кілттің өлшемі дұрыс емес

source: The key is of the wrong type
kk: Кілттің түрі дұрыс емес

source: No key is needed
kk: Кілт қажет емес

source: The key is different than before
kk: Кілт алдыңғысынан өзгеше

source: A key is needed
kk: Кілт қажет

source: Cannot include the key in the digest
kk: Кілтті дайджестке қосу мүмкін емес

source: This operation cannot be done with this key
kk: Бұл операцияны осы кілтпен орындау мүмкін емес

source: The key cannot be wrapped
kk: Кілтті орау мүмкін емес

source: Cannot export this key
kk: Бұл кілтті экспорттау мүмкін емес

source: The crypto mechanism is invalid or unrecognized
kk: Крипто механизмі жарамсыз немесе танылмады

source: The crypto mechanism has an invalid argument
kk: Крипто механизмінде жарамсыз аргумент бар

source: The object is missing or invalid
kk: Объект жоқ немесе жарамсыз

source: Another operation is already taking place
kk: Басқа операция қазірдің өзінде орындалуда

source: No operation is taking place
kk: Ешқандай операция орындалып жатқан жоқ

source: The password or PIN is incorrect
kk: Пароль немесе PIN дұрыс емес

source: The password or PIN is invalid
kk: Пароль немесе PIN жарамсыз

source: The password or PIN is of an invalid length
kk: Пароль немесе PIN ұзындығы жарамсыз

source: The password or PIN has expired
kk: Пароль немесе PIN мерзімі аяқталды

source: The password or PIN is locked
kk: Пароль немесе PIN құлыпталған

source: The session is closed
kk: Сессия жабылған

source: Too many sessions are active
kk: Тым көп сессия белсенді

source: The session is invalid
kk: Сессия жарамсыз

source: The session is read-only
kk: Сессия тек оқуға арналған

source: An open session exists
kk: Ашық сессия бар

source: A read-only session exists
kk: Тек оқуға арналған сессия бар

source: An administrator session exists
kk: Әкімші сессиясы бар

source: The signature is bad or corrupted
kk: Қолтаңба нашар немесе зақымдалған

source: The signature is unrecognized or corrupted
kk: Қолтаңба танылмады немесе зақымдалған

source: Certain required fields are missing
kk: Кейбір қажетті өрістер жоқ

source: Certain fields have invalid values
kk: Кейбір өрістерде жарамсыз мәндер бар

source: The device is not present or unplugged
kk: Құрылғы жоқ немесе ажыратылған

source: The device is invalid or unrecognizable
kk: Құрылғы жарамсыз немесе танылмайды

source: The device is write protected
kk: Құрылғы жазудан қорғалған

source: Cannot import because the key is invalid
kk: Кілт жарамсыз болғандықтан импорттау мүмкін емес

source: Cannot import because the key is of the wrong size
kk: Кілт өлшемі қате болғандықтан импорттау мүмкін емес

source: Cannot import because the key is of the wrong type
kk: Кілт түрі қате болғандықтан импорттау мүмкін емес

source: You are already logged in
kk: Сіз жүйеге кіріп қойғансыз

source: No user has logged in
kk: Ешбір пайдаланушы жүйеге кірмеген

source: The user's password or PIN is not set
kk: Пайдаланушының паролі немесе PIN орнатылмаған

source: The user is of an invalid type
kk: Пайдаланушының түрі жарамсыз

source: Another user is already logged in
kk: Басқа пайдаланушы жүйеге кіріп қойған

source: Too many users of different types are logged in
kk: Әртүрлі типтегі тым көп пайдаланушы жүйеге кірген

source: Cannot import an invalid key
kk: Жарамсыз кілтті импорттау мүмкін емес

source: Cannot import a key of the wrong size
kk: Өлшемі қате кілтті импорттау мүмкін емес

source: Cannot export because the key is invalid
kk: Кілт жарамсыз болғандықтан экспорттау мүмкін емес

source: Cannot export because the key is of the wrong size
kk: Кілт өлшемі қате болғандықтан экспорттау мүмкін емес

source: Cannot export because the key is of the wrong type
kk: Кілт түрі қате болғандықтан экспорттау мүмкін емес

source: Unable to initialize the random number generator
kk: Кездейсоқ сандар генераторын инициализациялау мүмкін емес

source: No random number generator available
kk: Кездейсоқ сандар генераторы қолжетімсіз

source: The crypto mechanism has an invalid parameter
kk: Крипто механизмінде жарамсыз параметр бар

source: Not enough space to store the result
kk: Нәтижені сақтау үшін орын жеткіліксіз

source: The saved state is invalid
kk: Сақталған күй жарамсыз

source: The information is sensitive and cannot be revealed
kk: Ақпарат құпия және оны көрсетуге болмайды

source: The state cannot be saved
kk: Күйді сақтау мүмкін емес

source: The module has not been initialized
kk: Модуль инициализацияланбаған

source: The module has already been initialized
kk: Модуль инициализацияланып қойған

source: Cannot lock data
kk: Деректерді құлыптау мүмкін емес

source: The data cannot be locked
kk: Деректерді құлыптауға болмайды

source: The request was rejected by the user
kk: Сұранымды пайдаланушы қабылдамады

source: Unknown error
kk: Белгісіз қате

source: couldn't load module: %s: %s
kk: модульді жүктеу мүмкін емес: %s: %s

source: couldn't find C_GetFunctionList entry point in module: %s: %s
kk: модульден C_GetFunctionList кіру нүктесі табылмады: %s: %s

source: call to C_GetFunctiontList failed in module: %s: %s
kk: модульде C_GetFunctiontList шақыру сәтсіз аяқталды: %s: %s

source: refusing to load the p11-kit-proxy.so module as a registered module
kk: p11-kit-proxy.so модулін тіркелген модуль ретінде жүктеуден бас тартылды

source: module '%s' has both enable-in and disable-in options
kk: '%s' модулінде enable-in және disable-in опцияларының екеуі де бар

source: aborting initialization because module '%s' was marked as critical
kk: '%s' модулі критикалық деп белгіленгендіктен, инициализациялау тоқтатылды

source: p11-kit initialization called recursively
kk: p11-kit инициализациялау рекурсивті түрде шақырылды

source: initialization of critical module '%s' failed: %s
kk: критикалық '%s' модулін инициализациялау сәтсіз аяқталды: %s

source: skipping module '%s' whose initialization failed: %s
kk: инициализациялауы сәтсіз аяқталған '%s' модулі өткізілуде: %s

source: couldn't close session: %s
kk: сессияны жабу мүмкін емес: %s

source: the '%s' option for module '%s' is only supported for managed modules
kk: '%s' модулі үшін '%s' опциясына тек басқарылатын модульдерде қолдау көрсетіледі

source: %s: module failed to initialize%s: %s
kk: %s: модуль инициализацияланбады%s: %s

source: %s: module was already initialized
kk: %s: модуль инициализацияланып қойған

source: %s: module failed to finalize: %s
kk: %s: модуль жұмысын аяқтай алмады: %s

source: module initialization failed: %s
kk: модульді инициализациялау сәтсіз: %s

source: %s: module failed to initialize: %s
kk: %s: модуль инициализацияланбады: %s

source: List modules and tokens
kk: Модульдер мен токендерді тізімдеу

source: Run a specific PKCS#11 module remotely
kk: Арнайы PKCS#11 модулін қашықтан іске қосу

source: Run a server process that exposes PKCS#11 module remotely
kk: PKCS#11 модулін қашықтан ұсынатын сервер процесін іске қосу

source: couldn't run trust tool
kk: trust құралын іске қосу мүмкін емес

source: '%s' is not a valid command. See 'p11-kit --help'
kk: '%s' — жарамды команда емес. 'p11-kit --help' қараңыз

source: specify a module or tokens to remote
kk: қашықтан басқару үшін модульді немесе токендерді көрсетіңіз

source: the 'remote' tool is not meant to be run from a terminal
kk: 'remote' құралы терминалдан іске қосуға арналмаған

source: only one module can be specified
kk: тек бір модуль көрсетуге болады

source: invalid rpc error response: too short
kk: жарамсыз rpc қате жауабы: тым қысқа

source: invalid rpc error response: bad error code
kk: жарамсыз rpc қате жауабы: қате коды бұрыс

source: invalid rpc response: call mismatch
kk: жарамсыз rpc жауабы: шақыру сәйкессіздігі

source: invalid rpc response: bad argument data
kk: жарамсыз rpc жауабы: аргумент деректері бұрыс

source: received an attribute array with wrong number of attributes
kk: атрибуттар саны қате атрибут массиві алынды

source: returned attributes in invalid order
kk: атрибуттар жарамсыз ретпен қайтарылды

source: invalid set of mutex calls supplied
kk: mutex шақыруларының жарамсыз жиыны ұсынылды

source: can't do without os locking
kk: os құлыптауынсыз орындау мүмкін емес

source: C_Initialize called twice for same process
kk: C_Initialize бір процесс үшін екі рет шақырылды

source: finalizing rpc module returned an error: %lu
kk: rpc модулін аяқтау қате қайтарды: %lu

source: invalid message: couldn't read call identifier
kk: жарамсыз хабарлама: шақыру идентификаторын оқу мүмкін емес

source: invalid message: bad call id: %d
kk: жарамсыз хабарлама: шақыру id қате: %d

source: invalid message: couldn't read signature
kk: жарамсыз хабарлама: қолтаңбаны оқу мүмкін емес

source: invalid message: signature doesn't match
kk: жарамсыз хабарлама: қолтаңба сәйкес келмейді

source: invalid length space padded string received: %d != %d
kk: бос орынмен толтырылған жолдың ұзындығы жарамсыз: %d != %d

source: invalid request from module, probably too short
kk: модульден жарамсыз сұраным, тым қысқа болуы мүмкін

source: couldn't initialize rpc response
kk: rpc жауабын инициализациялау мүмкін емес

source: invalid handshake received from connecting module
kk: қосылатын модульден жарамсыз қол алысу (handshake) алынды

source: couldn't parse pkcs11 rpc message
kk: pkcs11 rpc хабарламасын талдау мүмкін емес

source: out of memory error putting together message
kk: хабарламаны құрастыру кезінде жады жетіспеу қатесі

source: out of memory responding with error
kk: қатемен жауап беру кезінде жады жетіспеді

source: unsupported version received: %d
kk: қолдау көрсетілмейтін нұсқа алынды: %d

source: couldn't read credential byte
kk: тіркелгі деректерінің байтын оқу мүмкін емес

source: couldn't write credential byte
kk: тіркелгі деректерінің байтын жазу мүмкін емес

source: failed to read rpc message
kk: rpc хабарламасын оқу сәтсіз

source: unexpected error handling rpc message
kk: rpc хабарламасын өңдеуде күтпеген қате

source: failed to write rpc message
kk: rpc хабарламасын жазу сәтсіз

source: couldn't send data: closed connection
kk: деректерді жіберу мүмкін емес: байланыс жабық

source: couldn't send data
kk: деректерді жіберу мүмкін емес

source: couldn't receive data: closed connection
kk: деректерді қабылдау мүмкін емес: байланыс жабық

source: couldn't receive data
kk: деректерді қабылдау мүмкін емес

source: couldn't send socket credentials
kk: сокет тіркелгі деректерін жіберу мүмкін емес

source: received invalid rpc header values: perhaps wrong protocol
kk: жарамсыз rpc тақырыптама мәндері алынды: протокол қате болуы мүмкін

source: couldn't use select to wait on rpc pipe
kk: rpc арнасында күту үшін select пайдалану мүмкін болмады

source: closing socket due to protocol failure
kk: протокол сәтсіздігіне байланысты сокет жабылуда

source: process %d did not exit, terminating
kk: %d процесі шықпады, мәжбүрлеп тоқтатылуда

source: failed to wait for executed child: %d
kk: орындалған еншілес процесті күту сәтсіз: %d

source: process %d exited with status %d
kk: %d процесі %d күйімен аяқталды

source: process %d was terminated with signal %d
kk: %d процесі %d сигналымен тоқтатылды

source: failed to create pipe for remote
kk: remote үшін арна жасау сәтсіз

source: failed to fork for remote
kk: remote үшін тармақтау сәтсіз

source: process %p did not exit, terminating
kk: %p процесі шықпады, мәжбүрлеп тоқтатылуда

source: couldn't terminate process %p
kk: %p процесін тоқтату мүмкін емес

source: failed to wait for executed child: %p
kk: орындалған еншілес процесті күту сәтсіз: %p

source: failed to get the exit status of %p
kk: %p процесінің шығу күйін алу сәтсіз

source: process %p exited with status %lu
kk: %p процесі %lu күйімен аяқталды

source: failed to duplicate stdin
kk: stdin қайталау сәтсіз

source: failed to duplicate stdout
kk: stdout қайталау сәтсіз

source: failed to duplicate child end of pipe
kk: арнаның еншілес соңын қайталау сәтсіз

source: failed to spawn remote
kk: remote процесін бастау сәтсіз

source: failed to restore file descriptors
kk: файл дескрипторларын қалпына келтіру сәтсіз

source: invalid remote command line: %s
kk: жарамсыз remote пәрмен жолы: %s

source: failed to create socket for remote
kk: remote үшін сокет жасау сәтсіз

source: failed to parse vsock address: '%s'
kk: vsock адресін талдау сәтсіз: '%s'

source: remote not supported: %s
kk: remote қолдау көрсетпейді: %s

source: child %u died with sigsegv
kk: %u еншілес процесі sigsegv қатесімен құлады

source: child %u died with signal %d
kk: %u еншілес процесі %d сигналымен құлады

source: could not create socket %s
kk: %s сокетін жасау мүмкін емес

source: could not bind socket %s
kk: %s сокетін байланыстыру мүмкін емес

source: could not listen to socket %s
kk: %s сокетін тыңдау мүмкін емес

source: could not chown socket %s
kk: %s сокетіне chown орындау мүмкін емес

source: could not create socket %u:%u
kk: %u:%u сокетін жасау мүмкін емес

source: could not bind socket %u:%u
kk: %u:%u сокетін байланыстыру мүмкін емес

source: could not listen to socket %u:%u
kk: %u:%u сокетін тыңдау мүмкін емес

source: could not check uid from socket
kk: сокеттен uid тексеру мүмкін емес

source: connecting uid (%u) doesn't match expected (%u)
kk: қосылып тұрған uid (%u) күтілгенге сәйкес келмейді (%u)

source: connecting gid (%u) doesn't match expected (%u)
kk: қосылып тұрған gid (%u) күтілгенге сәйкес келмейді (%u)

source: could not fork() to daemonize
kk: демон режиміне өту үшін fork() орындау мүмкін емес

source: could not create a new session
kk: жаңа сессия жасау мүмкін емес

source: too many file descriptors received
kk: тым көп файл дескрипторлары алынды

source: no connections to %s for %lu secs, exiting
kk: %s үшін %lu секунд байланыс жоқ, шығу

source: could not accept from socket %s
kk: %s сокетінен қабылдау мүмкін емес

source: failed to fork for accept
kk: accept үшін тармақтау сәтсіз

source: unknown group: %s
kk: белгісіз топ: %s

source: unknown user: %s
kk: белгісіз пайдаланушы: %s

source: cannot set gid to %u
kk: gid мәнін %u деп орнату мүмкін емес

source: cannot setgroups to %u
kk: setgroups мәнін %u деп орнату мүмкін емес

source: cannot set uid to %u
kk: uid мәнін %u деп орнату мүмкін емес

source: cannot determine runtime directory
kk: орындалу ортасының бумасын анықтау мүмкін емес

source: cannot create %s
kk: %s жасау мүмкін емес

source: couldn't initialize Windows security functions
kk: Windows қауіпсіздік функцияларын инициализациялау мүмкін емес

source: unable to construct SID for %s: %lu
kk: %s үшін SID құрастыру мүмкін емес: %lu

source: unable to construct ACL: %d
kk: ACL құрастыру мүмкін емес: %d

source: unable to allocate security descriptor: %lu
kk: қауіпсіздік дескрипторын бөлу мүмкін емес: %lu

source: unable to initialise security descriptor: %lu
kk: қауіпсіздік дескрипторын инициализациялау мүмкін емес: %lu

source: unable to set owner in security descriptor: %lu
kk: қауіпсіздік дескрипторында иесін орнату мүмкін емес: %lu

source: unable to set DACL in security descriptor: %lu
kk: қауіпсіздік дескрипторында DACL орнату мүмкін емес: %lu

source: invalid PKCS#11 uri: %s
kk: жарамсыз PKCS#11 uri: %s

source: unrecognized file format: %s
kk: танылмаған файл пішімі: %s

source: failed to parse file: %s
kk: файлды талдау сәтсіз: %s

source: %s: couldn't initialize: %s
kk: %s: инициализациялау мүмкін емес: %s

source: %s: couldn't enumerate slots: %s
kk: %s: слоттарды нөмірлеу мүмкін емес: %s

source: %s: couldn't get token info: %s
kk: %s: токен ақпаратын алу мүмкін емес: %s

source: %s: couldn't open session: %s
kk: %s: сессияны ашу мүмкін емес: %s

source: no configured writable location to store anchors
kk: зәкірлерді сақтау үшін жазуға болатын орын бапталмаған

source: no configured location to store anchors
kk: зәкірлерді сақтау орны бапталмаған

source: couldn't create object: %s
kk: объект жасау мүмкін емес: %s

source: specify at least one anchor input file
kk: кемінде бір зәкір кіріс файлын көрсетіңіз

source: couldn't remove read-only %s
kk: тек оқуға арналған %s өшіру мүмкін емес

source: couldn't remove %s: %s
kk: %s өшіру мүмкін емес: %s

source: at least one file or uri must be specified
kk: кемінде бір файл немесе uri көрсетілуі керек

source: an action was already specified
kk: әрекет көрсетіліп қойған

source: %u error while processing
kk: өңдеу кезінде %u қате

source: %u errors while processing
kk: өңдеу кезінде %u қате

source: %.*s: invalid certificate extension
kk: %.*s: жарамсыз сертификат кеңейтуі

source: %.*s: invalid basic constraints certificate extension
kk: %.*s: жарамсыз basic constraints сертификат кеңейтуі

source: unknown
kk: белгісіз

source: missing the CKA_HASH_OF_SUBJECT_PUBLIC_KEY attribute
kk: CKA_HASH_OF_SUBJECT_PUBLIC_KEY атрибуты жоқ

source: missing the CKA_HASH_OF_ISSUER_PUBLIC_KEY attribute
kk: CKA_HASH_OF_ISSUER_PUBLIC_KEY атрибуты жоқ

source: the object is not modifiable
kk: объект өзгертілмейді

source: objects of this type cannot be created
kk: мұндай типті объектілерді жасау мүмкін емес

source: the %s attribute cannot be set
kk: %s атрибутын орнату мүмкін емес

source: the %s attribute cannot be changed
kk: %s атрибутын өзгерту мүмкін емес

source: the %s attribute has an invalid value
kk: %s атрибутының мәні жарамсыз

source: the %s attribute is not valid for the object
kk: %s атрибуты объект үшін жарамсыз

source: missing the %s attribute
kk: %s атрибуты жоқ

source: no CKA_CLASS attribute found
kk: CKA_CLASS атрибуты табылмады

source: cannot create a %s object
kk: %s объектісін жасау мүмкін емес

source: token
kk: токен

source: non-token
kk: токен емес

source: missing %s on object
kk: объектіде %s жоқ

source: %s unsupported %s
kk: %s қолдау көрсетілмейтін %s

source: %s unsupported object class
kk: %s қолдау көрсетілмейтін объект класы

source: invalid key usage certificate extension
kk: key usage сертификат кеңейтуі жарамсыз

source: invalid extended key usage certificate extension
kk: extended key usage сертификат кеңейтуі жарамсыз

source: invalid reject key usage certificate extension
kk: reject key usage сертификат кеңейтуі жарамсыз

source: could not dump object
kk: объектіні дамптау мүмкін емес

source: extra arguments passed to command
kk: командаға артық аргументтер берілді

source: couldn't parse attached certificate extension: %s
kk: тіркелген сертификат кеңейтуін талдау мүмкін емес: %s

source: couldn't load attached extensions for certificate: %s
kk: сертификат үшін тіркелген кеңейтулерді жүктеу мүмкін емес: %s

source: couldn't parse certificate: %s
kk: сертификатты талдау мүмкін емес: %s

source: couldn't load attributes: %s
kk: атрибуттарды жүктеу мүмкін емес: %s

source: skipping non-certificate object
kk: сертификат емес объект өткізілуде

source: couldn't load blocklist: %s
kk: блоктау тізімін жүктеу мүмкін емес: %s

source: a PKCS#11 URI has already been specified
kk: PKCS#11 URI көрсетіліп қойған

source: couldn't parse pkcs11 uri filter: %s
kk: pkcs11 uri сүзгісін талдау мүмкін емес: %s

source: uri contained unrecognized components, nothing will be extracted
kk: uri құрамында танылмаған құрамдастар бар, ештеңе алынбайды

source: unsupported or unrecognized filter: %s
kk: қолдау көрсетілмейтін немесе танылмаған сүзгі: %s

source: unsupported or unregonized purpose: %s
kk: қолдау көрсетілмейтін немесе танылмаған мақсат: %s

source: no modules containing trust policy are registered
kk: сенім саясаты бар ешқандай модуль тіркелмеген

source: a format was already specified
kk: пішім көрсетіліп қойған

source: unsupported or unrecognized format: %s
kk: қолдау көрсетілмейтін немесе танылмаған пішім: %s

source: format does not support trust policy
kk: пішім сенім саясатына қолдау көрсетпейді

source: format requires a purpose, specify it with --purpose; defaulting to 'server-auth'
kk: пішім мақсатты талап етеді, оны --purpose арқылы көрсетіңіз; 'server-auth' әдепкі мәні қолданылады

source: format does not support multiple purposes, defaulting to 'server-auth'
kk: пішім бірнеше мақсатқа қолдау көрсетпейді, 'server-auth' әдепкі мәні қолданылады

source: specify one destination file or directory
kk: бір мақсатты файлды немесе буманы көрсетіңіз

source: no output format specified
kk: шығыс пішімі көрсетілмеген

source: could not run %s command
kk: %s командасын орындау мүмкін емес

source: multiple certificates found but could only write one to file
kk: бірнеше сертификат табылды, бірақ файлға тек біреуін жазуға болады

source: failed to find certificates: %s
kk: сертификаттарды табу сәтсіз: %s

source: no certificate found
kk: сертификат табылмады

source: failed to find certificate: %s
kk: сертификатты табу сәтсіз: %s

source: truncating long string
kk: ұзын жол қысқартылуда

source: Environment variable $SOURCE_DATE_EPOCH: strtoull
kk: $SOURCE_DATE_EPOCH орта айнымалысы: strtoull

source: Environment variable $SOURCE_DATE_EPOCH: No digits were found: %s
kk: $SOURCE_DATE_EPOCH орта айнымалысы: Цифрлар табылмады: %s
