Repository: p11-glue/p11-kit
Catalog: po/*.po
Languages: kk

source: Environment variable $SOURCE_DATE_EPOCH: Trailing garbage: %s
kk: $SOURCE_DATE_EPOCH орта айнымалысы: Соңындағы қоқыс: %s

source: Environment variable $SOURCE_DATE_EPOCH: value must be smaller than or equal to %lu but was found to be: %llu
kk: $SOURCE_DATE_EPOCH орта айнымалысы: мән %lu тең немесе кіші болуы керек, бірақ ол мынадай болды: %llu

source: could not generate a certificate alias name
kk: сертификат бүркеншік атын жасау мүмкін емес

source: skipping object, couldn't build uri
kk: uri құру мүмкін емес, объект өткізілуде

source: unrecognized module argument: %s
kk: танылмаған модуль аргументі: %s

source: certificate with distrust in location for anchors: %s
kk: зәкірлер орнында сенімсіздігі бар сертификат: %s

source: overriding trust for anchor in blocklist: %s
kk: блоктау тізіміндегі зәкір үшін сенім қайта анықталуда: %s

source: Couldn't parse PEM block of type %s
kk: %s түріндегі PEM блогын талдау мүмкін емес

source: couldn't open and map file: %s
kk: файлды ашу және бейнелеу (map) мүмкін емес: %s

source: invalid oid value: %s
kk: oid мәні жарамсыз: %s

source: couldn't create file: %s%s
kk: файлды жасау мүмкін емес: %s%s

source: couldn't write to file: %s
kk: файлға жазу мүмкін емес: %s

source: couldn't complete writing of file: %s
kk: файлды жазуды аяқтау мүмкін емес: %s

source: couldn't write file: %s
kk: файлды жазу мүмкін емес: %s

source: couldn't set file permissions: %s
kk: файл рұқсаттарын орнату мүмкін емес: %s

source: couldn't complete writing file: %s
kk: файлды жазуды аяқтау мүмкін емес: %s

source: couldn't remove original file: %s
kk: түпнұсқа файлды өшіру мүмкін емес: %s

source: couldn't create directory: %s
kk: буманы жасау мүмкін емес: %s

source: directory already exists: %s
kk: бума бар болып тұр: %s

source: couldn't make directory writable: %s
kk: буманы жазылатын ету мүмкін емес: %s

source: couldn't create symlink: %s
kk: символдық сілтеме жасау мүмкін емес: %s

source: couldn't remove file: %s
kk: файлды өшіру мүмкін емес: %s

source: couldn't set directory permissions: %s
kk: бума рұқсаттарын орнату мүмкін емес: %s

source: couldn't load file into objects: %s
kk: файлды объектілерге жүктеу мүмкін емес: %s

source: couldn't stat path: %d: %s
kk: жол күйін алу мүмкін емес: %d: %s

source: cannot access trust certificate path: %s
kk: сенім сертификат жолына қол жеткізу мүмкін емес: %s

source: cannot access trust file: %s
kk: сенім файлына қол жеткізу мүмкін емес: %s

source: couldn't access: %s
kk: қол жеткізу мүмкін емес: %s
